In [25]:
import pandas as pd
import numpy as np

In [8]:
print(pd.__version__)

1.5.1

In [9]:
# Create a Series from stocks

stocks = ['PLW', 'CDR', '11B', 'TEN']
print(pd.Series(data=stocks))

0    PLW
1    CDR
2    11B
3    TEN
dtype: object

In [10]:
# Create a Series from dict

stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(data=stocks)
print(quotations)

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

In [11]:
# Convert quotations to the list and print it to the console.

print(quotations.tolist())

[387.0, 339.5, 349.5, 391.0]

In [17]:
# Convert the quotations to the DataFrame and set the column name to 'price'. In response, print this DataFrame to the console.

pd.DataFrame(quotations, columns= ['price'])

     price
PLW  387.0
CDR  339.5
TEN  349.5
11B  391.0

In [23]:
# Using the numpy and pandas create the following Series:
print(pd.Series({x: (x - 100) * 10.0 for x in range(101, 110)}))

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

In [27]:
pd.Series(
    data=np.arange(10, 100, 10), 
    index=np.arange(101, 110), 
    dtype='float'
)

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

In [35]:
# Convert following series's type to int and print this Series to the console.

series = pd.Series(['001', '002', '003', '004'], list('abcd'))

series = series.apply(lambda x : int(x))
print(series)


# other solutions

# series = pd.to_numeric(series)

# series = series.astype(int)

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
# Add two elements to quotation Series: key: 'BBT', value: 25.5 and key: 'F51', value: 19.2

new_vals = pd.Series({'BBT' : 25.5, 'F51' : 19.2})
quotations.append(new_vals)

C:\Users\Mavuba\AppData\Local\Temp\ipykernel_11844\737032365.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  quotations.append(new_vals)

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT     25.5
F51     19.2
dtype: float64

In [45]:
# Convert the quotations Series to DataFrame. Reset the index and name the columns 'ticker' and 'price' respectively.

df = pd.DataFrame(quotations)

df = df.reset_index()

df.rename(columns={'index' : 'ticker', 0 : 'price'})

  ticker  price
0    PLW  387.0
1    CDR  339.5
2    TEN  349.5
3    11B  391.0

In [52]:
# Create the following DataFrame object and assign it to the companies variable

data = {
    'company' : pd.Series(['Amazon', 'Microsoft', 'Facebook']), # It also works with lists instead of Series
    'price' : pd.Series([2375.0, 178.6, 179.2]),
    'ticker' : pd.Series(['AMZN.US', 'MSFT.US', 'FB.US'])}

companies = pd.DataFrame(data, columns = ['company', 'price', 'ticker'])

In [53]:
# Set index to company

companies.set_index('company')

            price   ticker
company
Amazon     2375.0  AMZN.US
Microsoft   178.6  MSFT.US
Facebook    179.2    FB.US